il-prof-f-a/ESP32-OT-Security-Assessment/src/security/security_manager.cpp
#include "security_manager.h"
#include "../core/logging_system.h"
#include "../core/configuration_manager.h"
#include "../network/ethernet_tx_if.h"
#include "../core/async_storage_engine.h"
#include "../core/reporting_engine.h"
#include "../core/psram_json_parser.h"
#include "../core/types.h"
#include "api_key_rotation_manager.h"
#include <algorithm>
#include <cstring>
#include <cctype>

#include "driver/gpio.h"

extern "C" {
    #include "esp_flash_encrypt.h"
    #include "esp_secure_boot.h"
    #include "lwip/inet.h"
    #include "esp_app_format.h"
    #include "nvs.h"
    #include "nvs_flash.h"
    #include "mbedtls/sha256.h"
    #include "mbedtls/pkcs5.h"
    #include "mbedtls/base64.h"
    #include "esp_random.h"
}

static const char* TAG_SEC = "Security";
extern ReportingEngine* g_reporting;

static constexpr uint64_t kApiKeyRotationMs = 90ULL * 24ULL * 60ULL * 60ULL * 1000ULL;
static constexpr uint64_t kApiKeyDisableMs = 120ULL * 24ULL * 60ULL * 60ULL * 1000ULL;

// PBKDF2 constants
static constexpr size_t PBKDF2_SALT_SIZE = 16;        // 16 bytes = 128 bits
static constexpr size_t PBKDF2_HASH_SIZE = 32;        // 32 bytes = 256 bits (SHA-256)
static constexpr uint32_t DEFAULT_PBKDF2_ITERATIONS = 100000;  // OWASP recommended minimum

static inline bool is_hex_char(char c) {
    return (c >= '0' && c <= '9') ||
           (c >= 'a' && c <= 'f') ||
           (c >= 'A' && c <= 'F');
}

static bool is_sha256_hex(const psram_string& value) {
    if (value.size() != 64) {
        return false;
    }
    for (size_t i = 0; i < value.size(); ++i) {
        if (!is_hex_char(value[i])) {
            return false;
        }
    }
    return true;
}

static bool is_pbkdf2_hash(const psram_string& value) {
    const psram_string prefix = PSRAMUtils::createPSRAMString("pbkdf2:");
    return value.size() > prefix.size() && value.substr(0, prefix.size()) == prefix;
}

static void zeroize_psram_string(psram_string& value) {
    for (size_t i = 0; i < value.size(); ++i) {
        value[i] = '\0';
    }
    value.clear();
}

static inline void log_api_key_preview(const char* token_preview_source) {
    if (!token_preview_source) {
        return;
    }
    char preview[9];
    size_t idx = 0;
    while (idx < sizeof(preview) - 1 && token_preview_source[idx] != '\0') {
        preview[idx] = token_preview_source[idx];
        ++idx;
    }
    preview[idx] = '\0';
    LOG_WARNINGF(TAG_SEC, "API key rejected: %s***", preview);
}

bool SecurityManager::readFuzzingGpioGateState() const {
    if (!fuzzing_gpio_gate_enabled_ || fuzzing_gpio_num_ < 0) {
        return true; // no physical gating
    }

    // gpio_get_level returns 0/1. We map it to an "ON" meaning based on active_high.
    const int level = gpio_get_level((gpio_num_t)fuzzing_gpio_num_);
    const bool raw_on = (level != 0);
    return fuzzing_gpio_active_high_ ? raw_on : !raw_on;
}

bool SecurityManager::isFuzzingAllowed() const {
    if (!fuzzing_allowed_) {
        return false;
    }

    if (fuzzing_gpio_gate_enabled_ && fuzzing_gpio_gate_required_) {
        return readFuzzingGpioGateState();
    }

    return true;
}

const char* SecurityManager::getFuzzingBlockReason() const {
    if (!fuzzing_allowed_) {
        return "disabled_in_security_config";
    }

    if (fuzzing_gpio_gate_enabled_ && fuzzing_gpio_gate_required_ && !readFuzzingGpioGateState()) {
        return "disabled_by_physical_switch";
    }

    return "allowed";
}

void SecurityManager::configureFuzzingGpioGate(bool enabled,
                                              int gpio_num,
                                              bool active_high,
                                              int pull_mode,
                                              bool require_gate) {
    fuzzing_gpio_gate_enabled_ = enabled;
    fuzzing_gpio_gate_required_ = require_gate;
    fuzzing_gpio_num_ = gpio_num;
    fuzzing_gpio_active_high_ = active_high;
    fuzzing_gpio_pull_mode_ = pull_mode;

    if (!enabled) {
        LOG_INFO(TAG_SEC, "Fuzzing GPIO gate disabled");
        return;
    }

    if (gpio_num < 0 || gpio_num >= (int)GPIO_NUM_MAX) {
        LOG_ERRORF(TAG_SEC, "Fuzzing GPIO gate invalid gpio_num=%d (disabling gate)", gpio_num);
        fuzzing_gpio_gate_enabled_ = false;
        fuzzing_gpio_gate_required_ = false;
        fuzzing_gpio_num_ = -1;
        return;
    }

    gpio_config_t io{};
    io.pin_bit_mask = (1ULL << (uint32_t)gpio_num);
    io.mode = GPIO_MODE_INPUT;
    io.intr_type = GPIO_INTR_DISABLE;
    io.pull_up_en = (pull_mode == 1) ? GPIO_PULLUP_ENABLE : GPIO_PULLUP_DISABLE;
    io.pull_down_en = (pull_mode == 2) ? GPIO_PULLDOWN_ENABLE : GPIO_PULLDOWN_DISABLE;

    esp_err_t err = gpio_config(&io);
    if (err != ESP_OK) {
        LOG_ERRORF(TAG_SEC, "Fuzzing GPIO gate gpio_config failed gpio=%d err=%d (disabling gate)", gpio_num, (int)err);
        fuzzing_gpio_gate_enabled_ = false;
        fuzzing_gpio_gate_required_ = false;
        fuzzing_gpio_num_ = -1;
        return;
    }

    LOG_INFOF(TAG_SEC,
              "Fuzzing GPIO gate configured: enabled=1 required=%d gpio=%d active_high=%d pull_mode=%d state=%d",
              (int)require_gate,
              gpio_num,
              (int)active_high,
              pull_mode,
              (int)readFuzzingGpioGateState());
}

bool SecurityManager::initialize(const SecurityConfig& cfg) {
    cfg_ = cfg;
    setAlertPolicy(cfg.alert_policy);
    last_email_alert_ms_ = 0;
    last_webhook_alert_ms_ = 0;
    temporary_admin_active_.store(false, std::memory_order_relaxed);

    // Log current hardware security state
    LOG_INFOF(TAG_SEC, "Secure Boot (efuse): %d", (int)isSecureBootEnabled());
    LOG_INFOF(TAG_SEC, "Flash Encryption (efuse): %d", (int)isFlashEncryptionEnabled());

    bool secure_boot_active = isSecureBootEnabled();
    bool flash_encryption_active = isFlashEncryptionEnabled();

    if (cfg_.secure_boot && !secure_boot_active) {
        raiseSecurityFault("secure_boot", "Enable eFuse secure boot before deployment");
    }
    if (cfg_.flash_encryption && !flash_encryption_active) {
        raiseSecurityFault("flash_encryption", "Enable flash encryption in eFuse");
    }

    if (cfg_.secure_boot && secure_boot_active) {
        LOG_INFO(TAG_SEC, "Secure Boot enabled and enforced");
    }
    if (cfg_.flash_encryption && flash_encryption_active) {
        LOG_INFO(TAG_SEC, "Flash encryption enabled and enforced");
    }

    // Inizializza storage PSRAM per API keys
    PSRAMAllocator<ApiKeyEntry> alloc;
    api_keys_ = psram_vector<ApiKeyEntry>(alloc);
    PSRAMAllocator<SecurityEventLog> event_alloc;
    security_events_ = psram_vector<SecurityEventLog>(event_alloc);

    // Deriva master key da chip ID (unico per dispositivo)
    uint8_t chip_id[6];
    esp_efuse_mac_get_default(chip_id);

    char* master_key_buf = (char*)heap_caps_malloc(64, MALLOC_CAP_SPIRAM);
    if (master_key_buf) {
        snprintf(master_key_buf, 64, "%02x%02x%02x%02x%02x%02x",
                chip_id[0], chip_id[1], chip_id[2],
                chip_id[3], chip_id[4], chip_id[5]);
        master_key_ = PSRAMUtils::createPSRAMString(master_key_buf);
        heap_caps_free(master_key_buf);
    }

    // Hardening: assicurarsi che la password admin sia conservata in forma hashed
    psram_string persisted_hash;
    if (loadAdminPasswordHash(persisted_hash) && is_sha256_hex(persisted_hash)) {
        admin_password_hash_ = persisted_hash;
        cfg_.admin_password = admin_password_hash_;
        temporary_admin_active_.store(false, std::memory_order_relaxed);
        LOG_INFO(TAG_SEC, "Admin password hash loaded from NVS");
    } else {
        psram_string candidate = cfg_.admin_password;
        bool derived_from_plaintext = false;
        bool generated_temp_password = false;
        psram_string temporary_password;

        if (candidate.empty()) {
            temporary_password = generateTemporaryPassword(16);
            if (!temporary_password.empty()) {
                LOG_WARNINGF(TAG_SEC,
                             "Admin password missing in configuration. Generated temporary credential: %s (rotate immediately)",
                             temporary_password.c_str());
                publishTemporaryAdminCredential(temporary_password);
                candidate = temporary_password;
                derived_from_plaintext = true;
                generated_temp_password = true;
            } else {
                LOG_ERROR(TAG_SEC, "Unable to generate temporary admin password");
            }
        } else if (!is_sha256_hex(candidate)) {
            derived_from_plaintext = true;
        }

        psram_string derived_hash;
        if (!candidate.empty() && is_sha256_hex(candidate)) {
            derived_hash = candidate;
        } else if (!candidate.empty()) {
            derived_hash = hashAdminPassword(candidate);
        }

