il-prof-f-a/ESP32-OT-Security-Assessment/src/security/security_manager.cpp
        if (derived_from_plaintext) {
            zeroize_psram_string(candidate);
        }

        if (!derived_hash.empty() && (is_sha256_hex(derived_hash) || is_pbkdf2_hash(derived_hash))) {
            if (derived_from_plaintext && !cfg_.admin_password.empty()) {
                zeroize_psram_string(cfg_.admin_password);
            }
            admin_password_hash_ = derived_hash;
            cfg_.admin_password = admin_password_hash_;
            if (!storeAdminPasswordHash(admin_password_hash_)) {
                LOG_WARNING(TAG_SEC, "Failed to persist admin password hash in NVS");
            } else {
                LOG_INFO(TAG_SEC, "Admin password hash stored in NVS");
            }
            if (generated_temp_password) {
                LOG_WARNING(TAG_SEC, "Temporary admin password active; update security.admin_password_hash as soon as possible.");
                temporary_admin_active_.store(true, std::memory_order_relaxed);
                zeroize_psram_string(temporary_password);
            } else {
                temporary_admin_active_.store(false, std::memory_order_relaxed);
            }
            if (derived_from_plaintext) {
                admin_hash_dirty_ = true;
            }
        } else {
            LOG_ERROR(TAG_SEC, "Failed to derive admin password hash");
        }
    }

    // Carica API keys da NVS
    loadApiKeysFromNVS();
    auditApiKeysForRotation();

    LOG_INFOF(TAG_SEC, "SecurityManager initialized with %zu API keys", api_keys_.size());
    return true;
}

void SecurityManager::shutdown() {}

bool SecurityManager::isSecureBootEnabled() const {
#if ESP_IDF_VERSION_MAJOR >= 4
    return esp_secure_boot_enabled();
#else
    return false;
#endif
}

bool SecurityManager::isFlashEncryptionEnabled() const {
#if ESP_IDF_VERSION_MAJOR >= 4
    return esp_flash_encryption_enabled();
#else
    return false;
#endif
}

std::string SecurityManager::getRunningAppSHA256() const {
    const esp_partition_t* part = esp_ota_get_running_partition();
    if (!part) return "";
    uint8_t sha[32] = {0};
    esp_err_t err = esp_app_get_elf_sha256((char*)sha, sizeof(sha));
    if (err != ESP_OK) return "";

    char hex[65];
    for (int i=0;i<32;++i) sprintf(hex + i*2, "%02x", sha[i]);
    hex[64] = 0;
    return std::string(hex);
}


bool SecurityManager::setExpectedFirmwareHash(const std::string& hex) {
    // Hardening: deve essere SHA-256 in esadecimale (64 char 0-9a-fA-F)
    auto is_hex = [](char c){
        return std::isdigit((unsigned char)c) ||
               (c >= 'a' && c <= 'f') ||
               (c >= 'A' && c <= 'F');
    };
    if (hex.size() != 64 || !std::all_of(hex.begin(), hex.end(), is_hex)) {
        LOG_ERROR("Security", "Invalid SHA-256 hex (len!=64 or bad chars)");
        return false;
    }

    // Normalizza in minuscolo per coerenza
    std::string hex_norm; hex_norm.reserve(64);
    for (char c : hex) hex_norm.push_back((char)std::tolower((unsigned char)c));

    esp_err_t e = AsyncStorage::Global::nvsSet("cfg", "fw_sha256", hex_norm);
    if (e != ESP_OK) {
        LOG_ERRORF("Security", "Failed to write fw_sha256 to NVS: %s", esp_err_to_name(e));
        return false;
    }
    return true;
}


bool SecurityManager::verifyFirmwareHash() const {
    std::string stored_hash;
    if (AsyncStorage::Global::nvsGet("cfg", "fw_sha256", stored_hash) != ESP_OK) return false;
    std::string now = getRunningAppSHA256();
    return !now.empty() && now == stored_hash;
}

bool SecurityManager::readFile(const std::string& path, std::string& out) const {
    return AsyncStorage::Global::readFile(path, out) == ESP_OK;
}

#pragma pack(push,1)
struct EthHdr { uint8_t dst[6]; uint8_t src[6]; uint16_t type; };
struct IPv4Hdr {
    uint8_t ver_ihl; uint8_t tos; uint16_t totlen; uint16_t id; uint16_t frag;
    uint8_t ttl; uint8_t proto; uint16_t chksum; uint32_t src; uint32_t dst;
};
struct TCPHdr {
    uint16_t sport; uint16_t dport; uint32_t seq; uint32_t ack;
    uint8_t off_res; uint8_t flags; uint16_t win; uint16_t chksum; uint16_t urg;
};
#pragma pack(pop)

static uint16_t ip_checksum(const void* vdata, size_t length) {
    const uint8_t* data = (const uint8_t*)vdata;
    uint32_t acc = 0;
    for (size_t i = 0; i + 1 < length; i += 2) {
        uint16_t word = (data[i] << 8) + data[i + 1];
        acc += word;
        if (acc > 0xffff) acc -= 0xffff;
    }
    if (length & 1) {
        acc += data[length - 1] << 8;
        if (acc > 0xffff) acc -= 0xffff;
    }
    return ~acc;
}

static uint16_t tcp_checksum(const IPv4Hdr* ip, const TCPHdr* tcp, const uint8_t* payload, size_t plen) {
    uint32_t acc = 0;
    // pseudo header
    acc += (ip->src >> 16) & 0xFFFF; acc += ip->src & 0xFFFF;
    acc += (ip->dst >> 16) & 0xFFFF; acc += ip->dst & 0xFFFF;
    acc += 0x0006; // TCP
    uint16_t tcp_len = (uint16_t)( ( (tcp->off_res >> 4) * 4 ) + plen );
    acc += tcp_len;
    // TCP header
    const uint16_t* w = (const uint16_t*)tcp;
    size_t tcp_hlen = (tcp->off_res >> 4) * 4;
    for (size_t i=0;i<tcp_hlen/2;i++) { acc += ntohs(w[i]); if (acc>0xFFFF) acc-=0xFFFF; }
    // payload
    for (size_t i=0;i+1<plen;i+=2) { acc += (payload[i]<<8)|payload[i+1]; if (acc>0xFFFF) acc-=0xFFFF; }
    if (plen & 1) { acc += payload[plen-1]<<8; if (acc>0xFFFF) acc-=0xFFFF; }
    return htons(~acc & 0xFFFF);
}

bool SecurityManager::loadPolicyFromConfig(const std::string& json) {
    // very small parse: look for "security": { "policy": { "block_s7_plc_stop": true } }
    const char* key = "\"block_s7_plc_stop\"";
    auto pos = json.find(key);
    if (pos == std::string::npos) return true; // keep default
    auto p2 = json.find_first_of("01truefals", pos + strlen(key));
    if (p2 == std::string::npos) return true;
    policy_.block_s7_plc_stop = (json.find("true", p2) == p2 || json.find('1', p2) == p2);
    return true;
}

bool SecurityManager::mitigateTcpByRst(const uint8_t* frame, size_t len, EthernetTxIf* tx) const {
    if (!tx || !frame || len < sizeof(EthHdr)+sizeof(IPv4Hdr)+sizeof(TCPHdr)) return false;
    const EthHdr* eth = (const EthHdr*)frame;
    if (ntohs(eth->type) != 0x0800) return false; // ipv4 only
    const IPv4Hdr* ip = (const IPv4Hdr*)(frame + sizeof(EthHdr));
    if (ip->proto != 6) return false; // tcp
    size_t ihl = (ip->ver_ihl & 0x0F) * 4;
    if (len < sizeof(EthHdr)+ihl+sizeof(TCPHdr)) return false;
    const TCPHdr* tcp = (const TCPHdr*)(frame + sizeof(EthHdr) + ihl);
    size_t thl = ((tcp->off_res >> 4) & 0x0F) * 4;
    if (len < sizeof(EthHdr)+ihl+thl) return false;
    size_t payload_len = ntohs(ip->totlen) - ihl - thl;

    // Build RST in reverse direction (to victim) and forward direction (to sender)
    auto build_send = [&](bool reverse)->bool{
        uint8_t out[14 + 20 + 20] = {0}; // eth+ip+tcp no options
        EthHdr* oeth = (EthHdr*)out;
        IPv4Hdr* oip = (IPv4Hdr*)(out + 14);
        TCPHdr* otcp = (TCPHdr*)(out + 14 + 20);
        const uint8_t* srcmac = reverse ? eth->dst : eth->src;
        const uint8_t* dstmac = reverse ? eth->src : eth->dst;
        memcpy(oeth->dst, dstmac, 6); memcpy(oeth->src, srcmac, 6); oeth->type = htons(0x0800);
        oip->ver_ihl = 0x45; oip->tos = 0; oip->totlen = htons(40); oip->id = 0; oip->frag = htons(0x4000);
        oip->ttl = 64; oip->proto = 6; oip->chksum = 0;
        oip->src = reverse ? ip->dst : ip->src;
        oip->dst = reverse ? ip->src : ip->dst;
        otcp->sport = reverse ? tcp->dport : tcp->sport;
        otcp->dport = reverse ? tcp->sport : tcp->dport;
        otcp->seq = reverse ? tcp->ack : htonl(ntohl(tcp->seq) + (uint32_t)payload_len);
        otcp->ack = reverse ? 0 : tcp->ack;
        otcp->off_res = (5 << 4);
        otcp->flags = 0x04; // RST
        otcp->win = 0; otcp->urg = 0; otcp->chksum = 0;
        oip->chksum = ip_checksum(oip, 20);
        otcp->chksum = tcp_checksum(oip, otcp, nullptr, 0);
        return tx->rawTx(out, sizeof(out));
    };
    bool a = build_send(false);
    bool b = build_send(true);
    return a || b;
}

bool SecurityManager::mitigateTcpByRst(const NetworkPacket& packet, EthernetTxIf* tx) const {
    if (!tx || !packet.is_tcp || packet.src_ip.empty() || packet.dst_ip.empty()) {
        return false;
    }

    auto mac_present = [](const uint8_t mac[6]) -> bool {
        for (int i = 0; i < 6; ++i) {
            if (mac[i] != 0) {
                return true;
            }
        }
        return false;
    };

    uint8_t host_mac[6];
    if (!tx->getMac(host_mac)) {
        return false;
    }

    auto send_rst = [&](bool reverse) -> bool {
        const uint8_t* dest_mac = reverse ? packet.dst_mac : packet.src_mac;
        if (!mac_present(dest_mac)) {
            return false;
        }

        const char* src_ip_str = reverse ? packet.dst_ip.c_str() : packet.src_ip.c_str();
        const char* dst_ip_str = reverse ? packet.src_ip.c_str() : packet.dst_ip.c_str();

        struct in_addr src_addr{}, dst_addr{};
        if (inet_aton(src_ip_str, &src_addr) == 0 || inet_aton(dst_ip_str, &dst_addr) == 0) {
            return false;
        }

        uint8_t frame[14 + 20 + 20] = {0};
        EthHdr* eth = (EthHdr*)frame;
        IPv4Hdr* ip = (IPv4Hdr*)(frame + sizeof(EthHdr));
        TCPHdr* tcp = (TCPHdr*)(frame + sizeof(EthHdr) + sizeof(IPv4Hdr));

        memcpy(eth->src, host_mac, 6);
        memcpy(eth->dst, dest_mac, 6);
        eth->type = htons(0x0800);

        ip->ver_ihl = 0x45;
        ip->tos = 0;
        ip->totlen = htons(40);
        ip->id = 0;
        ip->frag = htons(0x4000);
        ip->ttl = 64;
        ip->proto = 6;
        ip->chksum = 0;
        ip->src = src_addr.s_addr;
        ip->dst = dst_addr.s_addr;

        tcp->sport = htons(reverse ? packet.dst_port : packet.src_port);
        tcp->dport = htons(reverse ? packet.src_port : packet.dst_port);
        tcp->seq = htonl(esp_random());
        tcp->ack = 0;
        tcp->off_res = (5 << 4);
        tcp->flags = 0x04; // RST
        tcp->win = 0;
        tcp->urg = 0;
        tcp->chksum = 0;

        ip->chksum = ip_checksum(ip, sizeof(IPv4Hdr));
        tcp->chksum = tcp_checksum(ip, tcp, nullptr, 0);

        return tx->rawTx(frame, sizeof(frame));
    };

    bool forward = send_rst(false);
    bool reverse = send_rst(true);
    return forward || reverse;
}


//bool SecurityManager::loadPolicyFromConfig(const std::string& json);
extern bool json_find_bool(const std::string& s, const char* key, bool defval);

// Commented out unused function
/*
static bool find_key(const std::string& s, const char* key) {
    return s.find(key) != std::string::npos;
}
*/

// ========================= API AUTHENTICATION STUB METHODS =========================

bool SecurityManager::verifyApiKey(const psram_string& token) const {
    if (token.empty()) {
        return false;
    }

    psram_string token_hash = computeSHA256(token);
    if (token_hash.empty()) {
        return false;
    }

    uint64_t now_ms = esp_timer_get_time() / 1000ULL;
    bool verified = false;
    bool mutated_state = false;
    uint64_t age_ms = 0;
    std::string label_copy;
    std::string id_copy;

    {
        std::lock_guard<std::mutex> lock(api_keys_mutex_);

        for (const auto& entry : api_keys_) {
            if (!entry.enabled) {
                continue;
            }

            if (constantTimeCompare(token_hash, entry.hash)) {
                ApiKeyEntry& mutable_entry = const_cast<ApiKeyEntry&>(entry);
                mutable_entry.last_used_ms = now_ms;

                age_ms = (now_ms >= mutable_entry.created_ms) ?
                             (now_ms - mutable_entry.created_ms) : 0ULL;

