il-prof-f-a/ESP32-OT-Security-Assessment/src/security/security_manager.cpp
                mutated_state = updateApiKeyAgeState(mutable_entry, age_ms);
                label_copy.assign(mutable_entry.label.c_str());
                id_copy.assign(mutable_entry.id.c_str());
                verified = true;
                break;
            }
        }
    }

    if (verified) {
        const_cast<SecurityManager*>(this)->saveApiKeysToNVS();

        if (mutated_state) {
            LOG_WARNINGF(TAG_SEC,
                         "API key %s (%s) requires maintenance (age: %llu days)",
                         id_copy.c_str(),
                         label_copy.c_str(),
                         static_cast<unsigned long long>(age_ms / (24ULL * 60ULL * 60ULL * 1000ULL)));
        }

        LOG_INFOF(TAG_SEC, "API key verified: %s", label_copy.c_str());
        return true;
    }

    log_api_key_preview(token.c_str());
    return false;
}

bool SecurityManager::verifyApiKey(const char* token) const {
    if (!token || *token == '\0') {
        return false;
    }
    psram_string ps = PSRAMUtils::createPSRAMString(token);
    return verifyApiKey(ps);
}

bool SecurityManager::verifyApiKey(const std::string& token) const {
    if (token.empty()) {
        return false;
    }
    psram_string ps = PSRAMUtils::createPSRAMString(token.c_str());
    return verifyApiKey(ps);
}

bool SecurityManager::verifyAdminPassword(const psram_string& password) const {
    if (password.empty() || admin_password_hash_.empty()) {
        LOG_WARNING(TAG_SEC, "Admin password verification failed: missing input or hash");
        return false;
    }

    // Check if stored hash is PBKDF2 format
    if (admin_password_hash_.size() > 7 &&
        admin_password_hash_.substr(0, 7) == PSRAMUtils::createPSRAMString("pbkdf2:")) {

        // Parse PBKDF2 hash
        psram_string algorithm, salt_b64, hash_b64;
        uint32_t iterations = 0;

        if (!parsePasswordHash(admin_password_hash_, algorithm, salt_b64, iterations, hash_b64)) {
            LOG_ERROR(TAG_SEC, "Failed to parse PBKDF2 hash");
            return false;
        }

        // Decode salt from base64
        size_t salt_len = 0;
        mbedtls_base64_decode(nullptr, 0, &salt_len,
                             (const unsigned char*)salt_b64.c_str(), salt_b64.size());

        uint8_t* salt = (uint8_t*)heap_caps_malloc(salt_len, MALLOC_CAP_SPIRAM);
        if (!salt) {
            LOG_ERROR(TAG_SEC, "Failed to allocate PSRAM for salt");
            return false;
        }

        size_t actual_len = 0;
        int ret = mbedtls_base64_decode(salt, salt_len, &actual_len,
                                       (const unsigned char*)salt_b64.c_str(), salt_b64.size());
        if (ret != 0) {
            heap_caps_free(salt);
            LOG_ERRORF(TAG_SEC, "Failed to decode salt: %d", ret);
            return false;
        }

        // Compute PBKDF2 with provided password
        psram_string computed_hash_b64 = computePBKDF2(password, salt, actual_len, iterations);
        heap_caps_free(salt);

        if (computed_hash_b64.empty()) {
            LOG_ERROR(TAG_SEC, "Failed to compute PBKDF2 for verification");
            return false;
        }

        // Compare hashes in constant time
        bool valid = constantTimeCompare(computed_hash_b64, hash_b64);
        zeroize_psram_string(computed_hash_b64);

        if (valid) {
            LOG_INFO(TAG_SEC, "Admin password verified successfully (PBKDF2)");
        } else {
            LOG_WARNING(TAG_SEC, "Invalid admin password attempt (PBKDF2)");
        }

        return valid;

    } else if (is_sha256_hex(admin_password_hash_)) {
        // Legacy SHA-256 verification for backward compatibility
        LOG_INFO(TAG_SEC, "Using legacy SHA-256 verification (consider upgrading to PBKDF2)");

        psram_string material;
        size_t reserve_len = master_key_.size() + password.size() + 1;
        if (reserve_len < password.size()) {
            reserve_len = password.size() + 1;
        }
        material.reserve(reserve_len);

        if (!master_key_.empty()) {
            material.append(master_key_);
        }
        material.push_back(':');
        material.append(password);

        psram_string computed_hash = computeSHA256(material);
        zeroize_psram_string(material);

        if (computed_hash.empty()) {
            LOG_WARNING(TAG_SEC, "Admin password verification failed: cannot compute hash");
            return false;
        }

        bool valid = constantTimeCompare(computed_hash, admin_password_hash_);
        zeroize_psram_string(computed_hash);

        if (valid) {
            LOG_INFO(TAG_SEC, "Admin password verified successfully (legacy SHA-256)");
        } else {
            LOG_WARNING(TAG_SEC, "Invalid admin password attempt (legacy SHA-256)");
        }

        return valid;

    } else {
        LOG_ERROR(TAG_SEC, "Unknown password hash format");
        return false;
    }
}

bool SecurityManager::verifyAdminPassword(const char* password) const {
    if (!password || *password == '\0') {
        return false;
    }
    psram_string ps = PSRAMUtils::createPSRAMString(password);
    return verifyAdminPassword(ps);
}

bool SecurityManager::verifyAdminPassword(const std::string& password) const {
    if (password.empty()) {
        return false;
    }
    psram_string ps = PSRAMUtils::createPSRAMString(password.c_str());
    return verifyAdminPassword(ps);
}

std::vector<std::pair<std::string, std::string>> SecurityManager::listApiKeysMasked() const {
    std::vector<std::pair<std::string, std::string>> keys;

    std::lock_guard<std::mutex> lock(api_keys_mutex_);

    for (const auto& entry : api_keys_) {
        // Mask the hash: show first 8 chars and last 4 chars
        std::string masked_hash;
        if (entry.hash.size() > 12) {
            masked_hash = std::string(entry.hash.c_str(), 8) + "***" +
                         std::string(entry.hash.c_str() + entry.hash.size() - 4, 4);
        } else {
            masked_hash = "***";
        }

        keys.push_back({std::string(entry.id.c_str()), std::string(entry.label.c_str()) + " [" + masked_hash + "]"});
    }

