il-prof-f-a/ESP32-OT-Security-Assessment/src/security/security_manager.cpp
    LOG_INFOF(TAG_SEC, "Listed %zu API keys (masked)", keys.size());
    return keys;
}

std::string SecurityManager::createApiKey(const psram_string& label) {
    // Generate cryptographically secure token
    psram_string token = generateSecureToken();
    if (token.empty()) {
        LOG_ERROR(TAG_SEC, "Failed to generate secure token");
        return "";
    }

    // Compute SHA-256 hash of token
    psram_string token_hash = computeSHA256(token);
    if (token_hash.empty()) {
        LOG_ERROR(TAG_SEC, "Failed to compute token hash");
        return "";
    }

    // Create entry
    ApiKeyEntry entry;
    entry.id = generateUUID();
    entry.label = PSRAMUtils::createPSRAMString(label.c_str());
    entry.hash = token_hash;
    entry.created_ms = esp_timer_get_time() / 1000;
    entry.last_used_ms = 0;
    entry.enabled = true;

    // Store in vector
    {
        std::lock_guard<std::mutex> lock(api_keys_mutex_);
        api_keys_.push_back(entry);
    }

    // Persist to NVS
    if (!saveApiKeysToNVS()) {
        LOG_WARNING(TAG_SEC, "Failed to save API keys to NVS");
    }

    LOG_INFOF(TAG_SEC, "Created API key '%s' (ID: %s)", label.c_str(), entry.id.c_str());

    scheduleRotationForKey(entry);

    // Return the plain token (only time it's visible)
    return std::string(token.c_str());
}

std::string SecurityManager::createApiKey(const char* label) {
    psram_string ps = label ? PSRAMUtils::createPSRAMString(label) : PSRAMUtils::createPSRAMString("api");
    return createApiKey(ps);
}

std::string SecurityManager::createApiKey(const std::string& label) {
    psram_string ps = PSRAMUtils::createPSRAMString(label.c_str());
    return createApiKey(ps);
}

bool SecurityManager::revokeApiKey(const psram_string& id) {
    if (id.empty()) return false;

    bool found = false;
    std::string label_copy;

    {
        std::lock_guard<std::mutex> lock(api_keys_mutex_);

        for (auto& entry : api_keys_) {
            if (constantTimeCompare(entry.id, id)) {
                entry.enabled = false;
                entry.disable_alert_sent = true;
                label_copy.assign(entry.label.c_str());
                found = true;
                break;
            }
        }
    }

    if (!found) {
        LOG_WARNINGF(TAG_SEC, "API key not found: %s", id.c_str());
        return false;
    }

    cancelRotationForKey(id);

    if (!saveApiKeysToNVS()) {
        LOG_WARNING(TAG_SEC, "Failed to save API keys to NVS after revocation");
        return false;
    }

    LOG_INFOF(TAG_SEC, "Revoked API key: %s (%s)", label_copy.c_str(), id.c_str());
    return true;
}

bool SecurityManager::revokeApiKey(const char* id) {
    if (!id || *id == '\0') {
        return false;
    }
    psram_string ps = PSRAMUtils::createPSRAMString(id);
    return revokeApiKey(ps);
}

bool SecurityManager::revokeApiKey(const std::string& id) {
    if (id.empty()) {
        return false;
    }
    psram_string ps = PSRAMUtils::createPSRAMString(id.c_str());
    return revokeApiKey(ps);
}

bool SecurityManager::saveToConfig(ConfigurationManager* cfg) {
    if (!cfg) {
        return false;
    }

    size_t json_size = 0;
    char* json_buffer = cfg->getRawConfigInPSRAM(&json_size);
    if (!json_buffer || json_size == 0) {
        if (json_buffer) {
            heap_caps_free(json_buffer);
        }
        LOG_WARNING(TAG_SEC, "Cannot persist security configuration: empty JSON buffer");
        return false;
    }

    PSRAMJsonParser::PSRAMContext ctx;
    cJSON* root = PSRAMJsonParser::parseInPSRAM(json_buffer, json_size);
    heap_caps_free(json_buffer);
    if (!root) {
        LOG_WARNING(TAG_SEC, "Failed to parse configuration JSON for security persistence");
        return false;
    }

    cJSON* security_obj = cJSON_GetObjectItem(root, "security");
    if (!security_obj) {
        security_obj = cJSON_CreateObject();
        if (!security_obj) {
            cJSON_Delete(root);
            LOG_WARNING(TAG_SEC, "Unable to allocate security object for configuration save");
            return false;
        }
        cJSON_AddItemToObject(root, "security", security_obj);
    }

    // Remove any legacy plaintext field
    cJSON_DeleteItemFromObject(security_obj, "admin_password");

    if (!admin_password_hash_.empty()) {
        cJSON* new_hash = cJSON_CreateString(admin_password_hash_.c_str());
        if (!new_hash) {
            cJSON_Delete(root);
            LOG_WARNING(TAG_SEC, "Unable to allocate admin password hash node");
            return false;
        }
        if (cJSON_HasObjectItem(security_obj, "admin_password_hash")) {
            cJSON_ReplaceItemInObject(security_obj, "admin_password_hash", new_hash);
        } else {
            cJSON_AddItemToObject(security_obj, "admin_password_hash", new_hash);
        }
    }

    cJSON_DeleteItemFromObject(security_obj, "api_keys");
    cJSON* api_keys_array = cJSON_CreateArray();
    if (!api_keys_array) {
        cJSON_Delete(root);
        LOG_WARNING(TAG_SEC, "Unable to allocate api_keys array for configuration save");
        return false;
    }

    {
        std::lock_guard<std::mutex> lock(api_keys_mutex_);
        cfg_.api_keys.clear();
        for (const auto& entry : api_keys_) {
            cJSON* item = cJSON_CreateObject();
            if (!item) {
                cJSON_Delete(root);
                LOG_WARNING(TAG_SEC, "Unable to allocate api_key object for configuration save");
                return false;
            }

            cJSON_AddStringToObject(item, "id", entry.id.c_str());
            cJSON_AddStringToObject(item, "label", entry.label.c_str());
            cJSON_AddStringToObject(item, "hash", entry.hash.c_str());
            cJSON_AddBoolToObject(item, "enabled", entry.enabled);
            cJSON_AddNumberToObject(item, "created_ms", static_cast<double>(entry.created_ms));
            cJSON_AddNumberToObject(item, "last_used_ms", static_cast<double>(entry.last_used_ms));
            cJSON_AddItemToArray(api_keys_array, item);

            cfg_.api_keys[entry.id] = entry.hash;
        }
    }
    cJSON_AddItemToObject(security_obj, "api_keys", api_keys_array);

    SecurityAlertPolicy policy_snapshot;
    getAlertPolicy(policy_snapshot);

    cJSON_DeleteItemFromObject(security_obj, "alert_policy");
    cJSON* alert_policy = cJSON_CreateObject();
    if (!alert_policy) {
        cJSON_Delete(root);
        LOG_WARNING(TAG_SEC, "Unable to allocate alert_policy object for configuration save");
        return false;
    }

    cJSON* email_policy = cJSON_CreateObject();
    if (!email_policy) {
        cJSON_Delete(root);
        LOG_WARNING(TAG_SEC, "Unable to allocate email policy object for configuration save");
        return false;
    }
    cJSON_AddBoolToObject(email_policy, "enabled", policy_snapshot.email.enabled);
    cJSON_AddNumberToObject(email_policy, "throttle_minutes", static_cast<double>(policy_snapshot.email.throttle_minutes));
    if (!policy_snapshot.email.subject.empty()) {
        cJSON_AddStringToObject(email_policy, "subject", policy_snapshot.email.subject.c_str());
    }
    if (!policy_snapshot.email.recipients.empty()) {
        cJSON* recipients = cJSON_CreateArray();
        if (!recipients) {
            cJSON_Delete(root);
            LOG_WARNING(TAG_SEC, "Unable to allocate recipients array for configuration save");
            return false;
        }
        for (const auto& recipient : policy_snapshot.email.recipients) {
            cJSON_AddItemToArray(recipients, cJSON_CreateString(recipient.c_str()));
        }
        cJSON_AddItemToObject(email_policy, "recipients", recipients);
    }
    cJSON_AddItemToObject(alert_policy, "email", email_policy);

    cJSON* webhook_policy = cJSON_CreateObject();
    if (!webhook_policy) {
        cJSON_Delete(root);
        LOG_WARNING(TAG_SEC, "Unable to allocate webhook policy object for configuration save");
        return false;
    }
    cJSON_AddBoolToObject(webhook_policy, "enabled", policy_snapshot.webhook.enabled);
    if (!policy_snapshot.webhook.url.empty()) {
        cJSON_AddStringToObject(webhook_policy, "url", policy_snapshot.webhook.url.c_str());
    }
    if (!policy_snapshot.webhook.token.empty()) {
        cJSON_AddStringToObject(webhook_policy, "token", policy_snapshot.webhook.token.c_str());
    }
    cJSON_AddItemToObject(alert_policy, "webhook", webhook_policy);

    cJSON* gpio_policy = cJSON_CreateObject();
    if (!gpio_policy) {
        cJSON_Delete(root);
        LOG_WARNING(TAG_SEC, "Unable to allocate gpio policy object for configuration save");
        return false;
    }
    cJSON_AddBoolToObject(gpio_policy, "enabled", policy_snapshot.gpio.enabled);
    cJSON_AddNumberToObject(gpio_policy, "critical_pin", policy_snapshot.gpio.critical_pin);
    cJSON_AddNumberToObject(gpio_policy, "warning_pin", policy_snapshot.gpio.warning_pin);
    cJSON_AddNumberToObject(gpio_policy, "buzzer", policy_snapshot.gpio.buzzer_pin);
    cJSON_AddItemToObject(alert_policy, "gpio", gpio_policy);

