il-prof-f-a/ESP32-OT-Security-Assessment/src/security/security_manager.cpp
    cJSON_AddItemToObject(security_obj, "alert_policy", alert_policy);
    cfg_.alert_policy = policy_snapshot;

    char* updated_json = cJSON_PrintUnformatted(root);
    if (!updated_json) {
        cJSON_Delete(root);
        LOG_WARNING(TAG_SEC, "Failed to serialize updated security configuration");
        return false;
    }

    bool saved = cfg->saveConfigJSON(updated_json);
    free(updated_json);
    cJSON_Delete(root);

    if (!saved) {
        LOG_WARNING(TAG_SEC, "Failed to write security configuration to config.json");
        return false;
    }

    cfg_.admin_password = admin_password_hash_;
    admin_hash_dirty_ = false;
    LOG_INFO(TAG_SEC, "Security configuration persisted to config.json");
    return true;
}

// ========================= SECURE API KEY IMPLEMENTATION =========================

psram_string SecurityManager::generateTemporaryPassword(size_t length) const {
    static const char alphabet[] = "ABCDEFGHJKLMNPQRSTUVWXYZabcdefghijkmnpqrstuvwxyz23456789";
    if (length == 0) {
        return PSRAMUtils::createPSRAMString("");
    }

    char* buffer = (char*)heap_caps_malloc(length + 1, MALLOC_CAP_SPIRAM);
    if (!buffer) {
        LOG_ERROR(TAG_SEC, "Failed to allocate PSRAM for temporary password");
        return PSRAMUtils::createPSRAMString("");
    }

    for (size_t i = 0; i < length; ++i) {
        buffer[i] = alphabet[esp_random() % (sizeof(alphabet) - 1)];
    }
    buffer[length] = '\0';

    psram_string result = PSRAMUtils::createPSRAMString(buffer);
    heap_caps_free(buffer);
    return result;
}

psram_string SecurityManager::generateSecureToken() const {
    // Generate 256-bit (32 bytes) random token
    const size_t TOKEN_BYTES = 32;
    uint8_t* random_bytes = (uint8_t*)heap_caps_malloc(TOKEN_BYTES, MALLOC_CAP_SPIRAM);
    if (!random_bytes) {
        LOG_ERROR(TAG_SEC, "Failed to allocate PSRAM for token generation");
        return PSRAMUtils::createPSRAMString("");
    }

    // Fill with cryptographically secure random data
    for (size_t i = 0; i < TOKEN_BYTES; i++) {
        random_bytes[i] = (uint8_t)(esp_random() & 0xFF);
    }

    // Convert to hex string (64 chars)
    char* hex_token = (char*)heap_caps_malloc(TOKEN_BYTES * 2 + 1, MALLOC_CAP_SPIRAM);
    if (!hex_token) {
        heap_caps_free(random_bytes);
        LOG_ERROR(TAG_SEC, "Failed to allocate PSRAM for hex token");
        return PSRAMUtils::createPSRAMString("");
    }

    for (size_t i = 0; i < TOKEN_BYTES; i++) {
        snprintf(hex_token + i * 2, 3, "%02x", random_bytes[i]);
    }
    hex_token[TOKEN_BYTES * 2] = '\0';

    psram_string result = PSRAMUtils::createPSRAMString(hex_token);

    heap_caps_free(random_bytes);
    heap_caps_free(hex_token);

    return result;
}

psram_string SecurityManager::computeSHA256(const psram_string& data) const {
    if (data.empty()) {
        return PSRAMUtils::createPSRAMString("");
    }

    // Allocate buffer for hash output in PSRAM
    uint8_t* hash = (uint8_t*)heap_caps_malloc(32, MALLOC_CAP_SPIRAM);
    if (!hash) {
        LOG_ERROR(TAG_SEC, "Failed to allocate PSRAM for SHA256 hash");
        return PSRAMUtils::createPSRAMString("");
    }

    // Compute SHA-256
    mbedtls_sha256_context ctx;
    mbedtls_sha256_init(&ctx);
    mbedtls_sha256_starts(&ctx, 0); // 0 = SHA-256 (not SHA-224)
    mbedtls_sha256_update(&ctx, (const unsigned char*)data.c_str(), data.size());
    mbedtls_sha256_finish(&ctx, hash);
    mbedtls_sha256_free(&ctx);

    // Convert to hex string in PSRAM
    char* hex_hash = (char*)heap_caps_malloc(65, MALLOC_CAP_SPIRAM);
    if (!hex_hash) {
        heap_caps_free(hash);
        LOG_ERROR(TAG_SEC, "Failed to allocate PSRAM for hex hash");
        return PSRAMUtils::createPSRAMString("");
    }

    for (int i = 0; i < 32; i++) {
        snprintf(hex_hash + i * 2, 3, "%02x", hash[i]);
    }
    hex_hash[64] = '\0';

    psram_string result = PSRAMUtils::createPSRAMString(hex_hash);

    heap_caps_free(hash);
    heap_caps_free(hex_hash);

    return result;
}

psram_string SecurityManager::generateRandomSalt(size_t salt_size) const {
    // Generate cryptographically secure random salt
    uint8_t* salt = (uint8_t*)heap_caps_malloc(salt_size, MALLOC_CAP_SPIRAM);
    if (!salt) {
        LOG_ERROR(TAG_SEC, "Failed to allocate PSRAM for salt");
        return PSRAMUtils::createPSRAMString("");
    }

    // Use ESP32 hardware RNG
    esp_fill_random(salt, salt_size);

    // Encode to base64
    size_t b64_len = 0;
    mbedtls_base64_encode(nullptr, 0, &b64_len, salt, salt_size);

    char* b64_salt = (char*)heap_caps_malloc(b64_len + 1, MALLOC_CAP_SPIRAM);
    if (!b64_salt) {
        heap_caps_free(salt);
        LOG_ERROR(TAG_SEC, "Failed to allocate PSRAM for base64 salt");
        return PSRAMUtils::createPSRAMString("");
    }

    size_t actual_len = 0;
    int ret = mbedtls_base64_encode((unsigned char*)b64_salt, b64_len, &actual_len, salt, salt_size);
    if (ret != 0) {
        heap_caps_free(salt);
        heap_caps_free(b64_salt);
        LOG_ERRORF(TAG_SEC, "Base64 encoding failed: %d", ret);
        return PSRAMUtils::createPSRAMString("");
    }

    b64_salt[actual_len] = '\0';
    psram_string result = PSRAMUtils::createPSRAMString(b64_salt);

    heap_caps_free(salt);
    heap_caps_free(b64_salt);

    return result;
}

psram_string SecurityManager::computePBKDF2(const psram_string& password,
                                            const uint8_t* salt,
                                            size_t salt_len,
                                            uint32_t iterations) const {
    if (password.empty() || !salt || salt_len == 0) {
        LOG_WARNING(TAG_SEC, "Invalid PBKDF2 input");
        return PSRAMUtils::createPSRAMString("");
    }

    // Allocate output buffer for hash
    uint8_t* output = (uint8_t*)heap_caps_malloc(PBKDF2_HASH_SIZE, MALLOC_CAP_SPIRAM);
    if (!output) {
        LOG_ERROR(TAG_SEC, "Failed to allocate PSRAM for PBKDF2 output");
        return PSRAMUtils::createPSRAMString("");
    }

    // Compute PBKDF2-HMAC-SHA256
    int ret = mbedtls_pkcs5_pbkdf2_hmac_ext(MBEDTLS_MD_SHA256,
                                            (const unsigned char*)password.c_str(),
                                            password.size(),
                                            salt,
                                            salt_len,
                                            iterations,
                                            PBKDF2_HASH_SIZE,
                                            output);

    if (ret != 0) {
        heap_caps_free(output);
        LOG_ERRORF(TAG_SEC, "PBKDF2 computation failed: %d", ret);
        return PSRAMUtils::createPSRAMString("");
    }

    // Encode to base64
    size_t b64_len = 0;
    mbedtls_base64_encode(nullptr, 0, &b64_len, output, PBKDF2_HASH_SIZE);

    char* b64_hash = (char*)heap_caps_malloc(b64_len + 1, MALLOC_CAP_SPIRAM);
    if (!b64_hash) {
        heap_caps_free(output);
        LOG_ERROR(TAG_SEC, "Failed to allocate PSRAM for base64 hash");
        return PSRAMUtils::createPSRAMString("");
    }

