il-prof-f-a/ESP32-OT-Security-Assessment/src/security/security_manager.cpp
    size_t actual_len = 0;
    ret = mbedtls_base64_encode((unsigned char*)b64_hash, b64_len, &actual_len, output, PBKDF2_HASH_SIZE);

    heap_caps_free(output);

    if (ret != 0) {
        heap_caps_free(b64_hash);
        LOG_ERRORF(TAG_SEC, "Base64 encoding failed: %d", ret);
        return PSRAMUtils::createPSRAMString("");
    }

    b64_hash[actual_len] = '\0';
    psram_string result = PSRAMUtils::createPSRAMString(b64_hash);
    heap_caps_free(b64_hash);

    return result;
}

bool SecurityManager::parsePasswordHash(const psram_string& stored_hash,
                                       psram_string& out_algorithm,
                                       psram_string& out_salt_b64,
                                       uint32_t& out_iterations,
                                       psram_string& out_hash_b64) const {
    // Expected format: "pbkdf2:salt_b64:iterations:hash_b64"
    if (stored_hash.empty()) {
        return false;
    }

    // Find delimiters
    size_t first_colon = stored_hash.find(':');
    if (first_colon == psram_string::npos) {
        return false;
    }

    size_t second_colon = stored_hash.find(':', first_colon + 1);
    if (second_colon == psram_string::npos) {
        return false;
    }

    size_t third_colon = stored_hash.find(':', second_colon + 1);
    if (third_colon == psram_string::npos) {
        return false;
    }

    // Parse algorithm
    out_algorithm = PSRAMUtils::createPSRAMString(stored_hash.substr(0, first_colon).c_str());

    // Parse salt
    out_salt_b64 = PSRAMUtils::createPSRAMString(
        stored_hash.substr(first_colon + 1, second_colon - first_colon - 1).c_str()
    );

    // Parse iterations
    psram_string iter_str = PSRAMUtils::createPSRAMString(
        stored_hash.substr(second_colon + 1, third_colon - second_colon - 1).c_str()
    );
    out_iterations = (uint32_t)atoi(iter_str.c_str());

    // Parse hash
    out_hash_b64 = PSRAMUtils::createPSRAMString(stored_hash.substr(third_colon + 1).c_str());

    return !out_algorithm.empty() && !out_salt_b64.empty() &&
           out_iterations > 0 && !out_hash_b64.empty();
}

bool SecurityManager::constantTimeCompare(const psram_string& a, const psram_string& b) const {
    // Constant-time comparison to prevent timing attacks
    if (a.size() != b.size()) {
        return false;
    }

    volatile uint8_t result = 0;
    for (size_t i = 0; i < a.size(); i++) {
        result |= (a[i] ^ b[i]);
    }

    return result == 0;
}

psram_string SecurityManager::generateUUID() const {
    // Generate UUID v4 (random) format: xxxxxxxx-xxxx-4xxx-yxxx-xxxxxxxxxxxx
    // where y is one of [8, 9, a, b]

    char* uuid = (char*)heap_caps_malloc(37, MALLOC_CAP_SPIRAM); // 36 chars + null
    if (!uuid) {
        LOG_ERROR(TAG_SEC, "Failed to allocate PSRAM for UUID");
        return PSRAMUtils::createPSRAMString("");
    }

    uint32_t r1 = esp_random();
    uint32_t r2 = esp_random();
    uint32_t r3 = esp_random();
    uint32_t r4 = esp_random();

    snprintf(uuid, 37, "%08lx-%04x-4%03x-%04x-%08lx%04x",
             (unsigned long)r1,
             (unsigned int)(r2 >> 16),
             (unsigned int)(r2 & 0x0FFF),
             (unsigned int)(0x8000 | (r3 & 0x3FFF)),
             (unsigned long)(r4),
             (unsigned int)(r3 >> 16));

    psram_string result = PSRAMUtils::createPSRAMString(uuid);
    heap_caps_free(uuid);

    return result;
}

bool SecurityManager::loadApiKeysFromNVS() {
    nvs_handle_t handle;
    esp_err_t err = nvs_open("security", NVS_READONLY, &handle);
    if (err != ESP_OK) {
        LOG_INFOF(TAG_SEC, "No existing API keys in NVS: %s", esp_err_to_name(err));
        return false;
    }

    // Get number of stored keys
    uint32_t key_count = 0;
    err = nvs_get_u32(handle, "api_key_count", &key_count);
    if (err != ESP_OK || key_count == 0) {
        nvs_close(handle);
        LOG_INFO(TAG_SEC, "No API keys found in NVS");
        return false;
    }

    std::lock_guard<std::mutex> lock(api_keys_mutex_);
    api_keys_.clear();

    // Load each key
    for (uint32_t i = 0; i < key_count && i < 100; i++) { // Max 100 keys
        char key_prefix[32];
        snprintf(key_prefix, sizeof(key_prefix), "key_%lu_", (unsigned long)i);

        // Read ID
        size_t id_len = 0;
        char id_key[40];
        snprintf(id_key, sizeof(id_key), "%sid", key_prefix);
        err = nvs_get_str(handle, id_key, NULL, &id_len);
        if (err != ESP_OK || id_len == 0) continue;

        char* id_buf = (char*)heap_caps_malloc(id_len, MALLOC_CAP_SPIRAM);
        if (!id_buf) continue;
        nvs_get_str(handle, id_key, id_buf, &id_len);

        // Read label
        size_t label_len = 0;
        char label_key[40];
        snprintf(label_key, sizeof(label_key), "%slabel", key_prefix);
        err = nvs_get_str(handle, label_key, NULL, &label_len);
        if (err != ESP_OK || label_len == 0) {
            heap_caps_free(id_buf);
            continue;
        }

        char* label_buf = (char*)heap_caps_malloc(label_len, MALLOC_CAP_SPIRAM);
        if (!label_buf) {
            heap_caps_free(id_buf);
            continue;
        }
        nvs_get_str(handle, label_key, label_buf, &label_len);

        // Read hash
        size_t hash_len = 0;
        char hash_key[40];
        snprintf(hash_key, sizeof(hash_key), "%shash", key_prefix);
        err = nvs_get_str(handle, hash_key, NULL, &hash_len);
        if (err != ESP_OK || hash_len == 0) {
            heap_caps_free(id_buf);
            heap_caps_free(label_buf);
            continue;
        }

        char* hash_buf = (char*)heap_caps_malloc(hash_len, MALLOC_CAP_SPIRAM);
        if (!hash_buf) {
            heap_caps_free(id_buf);
            heap_caps_free(label_buf);
            continue;
        }
        nvs_get_str(handle, hash_key, hash_buf, &hash_len);

        // Read timestamps and enabled flag
        uint64_t created_ms = 0, last_used_ms = 0;
        uint8_t enabled = 1;
        uint8_t rotation_alert = 0;
        uint8_t disable_alert = 0;
        char created_key[48], last_used_key[48], enabled_key[48], rot_key[48], dis_key[48];
        snprintf(created_key, sizeof(created_key), "%screated", key_prefix);
        snprintf(last_used_key, sizeof(last_used_key), "%slast_used", key_prefix);
        snprintf(enabled_key, sizeof(enabled_key), "%senabled", key_prefix);
        snprintf(rot_key, sizeof(rot_key), "%srotation_alert", key_prefix);
        snprintf(dis_key, sizeof(dis_key), "%sdisable_alert", key_prefix);

        nvs_get_u64(handle, created_key, &created_ms);
        nvs_get_u64(handle, last_used_key, &last_used_ms);
        nvs_get_u8(handle, enabled_key, &enabled);
        if (nvs_get_u8(handle, rot_key, &rotation_alert) != ESP_OK) {
            rotation_alert = 0;
        }
        if (nvs_get_u8(handle, dis_key, &disable_alert) != ESP_OK) {
            disable_alert = 0;
        }

        // Create entry
        ApiKeyEntry entry;
        entry.id = PSRAMUtils::createPSRAMString(id_buf);
        entry.label = PSRAMUtils::createPSRAMString(label_buf);
        entry.hash = PSRAMUtils::createPSRAMString(hash_buf);
        entry.created_ms = created_ms;
        entry.last_used_ms = last_used_ms;
        entry.enabled = (enabled != 0);
        entry.rotation_alert_sent = (rotation_alert != 0);
        entry.disable_alert_sent = (disable_alert != 0);

        if (entry.rotation_alert_sent) {
            scheduleRotationForKey(entry);
        } else if (!entry.enabled) {
            cancelRotationForKey(entry.id);
        }

        api_keys_.push_back(entry);

        heap_caps_free(id_buf);
        heap_caps_free(label_buf);
        heap_caps_free(hash_buf);
    }

    nvs_close(handle);
    LOG_INFOF(TAG_SEC, "Loaded %zu API keys from NVS", api_keys_.size());
    return true;
}

bool SecurityManager::saveApiKeysToNVS() {
    nvs_handle_t handle;
    esp_err_t err = nvs_open("security", NVS_READWRITE, &handle);
    if (err != ESP_OK) {
        LOG_ERRORF(TAG_SEC, "Failed to open NVS for writing: %s", esp_err_to_name(err));
        return false;
    }

    std::lock_guard<std::mutex> lock(api_keys_mutex_);

