il-prof-f-a/ESP32-OT-Security-Assessment/src/security/security_manager.cpp
    // Clear old keys
    nvs_erase_all(handle);

    // Save key count
    uint32_t key_count = (uint32_t)api_keys_.size();
    err = nvs_set_u32(handle, "api_key_count", key_count);
    if (err != ESP_OK) {
        nvs_close(handle);
        LOG_ERRORF(TAG_SEC, "Failed to write key count: %s", esp_err_to_name(err));
        return false;
    }

    // Save each key
    for (size_t i = 0; i < api_keys_.size(); i++) {
        const ApiKeyEntry& entry = api_keys_[i];
        char key_prefix[32];
        snprintf(key_prefix, sizeof(key_prefix), "key_%zu_", i);

        char key_name[48];

        // Save ID
        snprintf(key_name, sizeof(key_name), "%sid", key_prefix);
        nvs_set_str(handle, key_name, entry.id.c_str());

        // Save label
        snprintf(key_name, sizeof(key_name), "%slabel", key_prefix);
        nvs_set_str(handle, key_name, entry.label.c_str());

        // Save hash
        snprintf(key_name, sizeof(key_name), "%shash", key_prefix);
        nvs_set_str(handle, key_name, entry.hash.c_str());

        // Save timestamps
        snprintf(key_name, sizeof(key_name), "%screated", key_prefix);
        nvs_set_u64(handle, key_name, entry.created_ms);

        snprintf(key_name, sizeof(key_name), "%slast_used", key_prefix);
        nvs_set_u64(handle, key_name, entry.last_used_ms);

        // Save enabled flag
        snprintf(key_name, sizeof(key_name), "%senabled", key_prefix);
        nvs_set_u8(handle, key_name, entry.enabled ? 1 : 0);

        // Save rotation alert state
        snprintf(key_name, sizeof(key_name), "%srotation_alert", key_prefix);
        nvs_set_u8(handle, key_name, entry.rotation_alert_sent ? 1 : 0);

        // Save disable alert state
        snprintf(key_name, sizeof(key_name), "%sdisable_alert", key_prefix);
        nvs_set_u8(handle, key_name, entry.disable_alert_sent ? 1 : 0);
    }

    err = nvs_commit(handle);
    nvs_close(handle);

    if (err != ESP_OK) {
        LOG_ERRORF(TAG_SEC, "Failed to commit NVS: %s", esp_err_to_name(err));
        return false;
    }

    LOG_INFOF(TAG_SEC, "Saved %zu API keys to NVS", api_keys_.size());
    return true;
}

void SecurityManager::raiseSecurityFault(const char* feature, const char* recommendation) {
    if (!feature) {
        return;
    }

    fuzzing_allowed_ = false;
    security_gap_detected_ = true;

    const char* action = recommendation ? recommendation : "";
    LOG_ERRORF(TAG_SEC, "Security hardening requirement not met: %s -> %s", feature, action);

    if (g_reporting) {
        char buffer[256];
        snprintf(buffer, sizeof(buffer),
                 "{\"feature\":\"%s\",\"status\":\"non_compliant\",\"recommendation\":\"%s\",\"mitigation\":\"fuzzing_disabled\"}",
                 feature, action);
        psram_string type = PSRAMUtils::createPSRAMString("security_hardening");
        psram_string payload = PSRAMUtils::createPSRAMString(buffer);
        g_reporting->reportEvent(type, payload);
    }
}

void SecurityManager::publishTemporaryAdminCredential(const psram_string& password) const {
    if (password.empty()) {
        return;
    }

    cJSON* root = cJSON_CreateObject();
    if (!root) {
        return;
    }

    cJSON_AddStringToObject(root, "type", "security.admin.temp_password");
    cJSON_AddStringToObject(root, "username", "admin");
    cJSON_AddStringToObject(root, "credential", password.c_str());
    cJSON_AddStringToObject(root, "action", "rotate_immediately");

    char* json = cJSON_PrintUnformatted(root);
    if (json) {
        psram_string detail = PSRAMUtils::createPSRAMString(json);
        psram_string summary = PSRAMUtils::createPSRAMString("Temporary admin password generated");
        const_cast<SecurityManager*>(this)->recordSecurityEvent(
            "security.admin.temp_password",
            "critical",
            summary,
            detail);
        const_cast<SecurityManager*>(this)->temporary_admin_active_.store(true, std::memory_order_relaxed);
        free(json);
    }
    cJSON_Delete(root);
}

void SecurityManager::emitApiKeySecurityEvent(const ApiKeyEntry& entry,
                                              const char* event_type,
                                              uint64_t age_ms,
                                              bool disabled) const {
    if (!event_type) {
        return;
    }

    cJSON* root = cJSON_CreateObject();
    if (!root) {
        return;
    }

    cJSON_AddStringToObject(root, "type", event_type);
    cJSON_AddStringToObject(root, "id", entry.id.c_str());
    cJSON_AddStringToObject(root, "label", entry.label.c_str());
    cJSON_AddNumberToObject(root, "age_days",
                            static_cast<double>(age_ms) / (24.0 * 60.0 * 60.0 * 1000.0));
    cJSON_AddBoolToObject(root, "disabled", disabled);
    char* json = cJSON_PrintUnformatted(root);
    if (json) {
        psram_string detail = PSRAMUtils::createPSRAMString(json);
        char summary_buf[160];
        const unsigned long long age_days = static_cast<unsigned long long>(age_ms / (24ULL * 60ULL * 60ULL * 1000ULL));
        snprintf(summary_buf, sizeof(summary_buf),
                 "API key %s (%s) %s%llud",
                 entry.id.c_str(),
                 entry.label.c_str(),
                 disabled ? "disabled pending rotation - age " : "requires rotation - age ",
                 age_days);
        psram_string summary = PSRAMUtils::createPSRAMString(summary_buf);
        const char* severity = disabled ? "critical" : "warning";
        const_cast<SecurityManager*>(this)->recordSecurityEvent(
            event_type,
            severity,
            summary,
            detail);
        free(json);
    }
    cJSON_Delete(root);
}

bool SecurityManager::updateApiKeyAgeState(ApiKeyEntry& entry, uint64_t age_ms) const {
    bool mutated = false;

    if (age_ms > kApiKeyRotationMs) {
        if (!entry.rotation_alert_sent) {
            LOG_WARNINGF(TAG_SEC,
                         "API key %s (%s) exceeded rotation threshold (age: %llu days)",
                         entry.id.c_str(),
                         entry.label.c_str(),
                         static_cast<unsigned long long>(age_ms /
                             (24ULL * 60ULL * 60ULL * 1000ULL)));
            emitApiKeySecurityEvent(entry, "security.api_key.rotation_required", age_ms, false);
            entry.rotation_alert_sent = true;
            mutated = true;
            scheduleRotationForKey(entry);
        }

        if (age_ms > kApiKeyDisableMs) {
            if (entry.enabled) {
                entry.enabled = false;
                LOG_WARNINGF(TAG_SEC,
                             "API key %s disabled pending rotation",
                             entry.id.c_str());
                emitApiKeySecurityEvent(entry, "security.api_key.disabled", age_ms, true);
                mutated = true;
                cancelRotationForKey(entry.id);
            } else if (!entry.disable_alert_sent) {
                emitApiKeySecurityEvent(entry, "security.api_key.disabled", age_ms, true);
                mutated = true;
            }
            entry.disable_alert_sent = true;
        }
    }

    return mutated;
}

