il-prof-f-a/ESP32-OT-Security-Assessment/src/security/security_manager.cpp
void SecurityManager::auditApiKeysForRotation() {
    uint64_t now_ms = esp_timer_get_time() / 1000ULL;
    bool mutated = false;

    {
        std::lock_guard<std::mutex> lock(api_keys_mutex_);
        for (auto& entry : api_keys_) {
            uint64_t age_ms = (now_ms >= entry.created_ms)
                                  ? (now_ms - entry.created_ms)
                                  : 0ULL;
            if (age_ms == 0) {
                continue;
            }
            if (updateApiKeyAgeState(entry, age_ms)) {
                mutated = true;
            }
        }
    }

    if (mutated) {
        saveApiKeysToNVS();
    }
}

void SecurityManager::scheduleRotationForKey(const ApiKeyEntry& entry) const {
    if (!g_api_key_rotation_manager) {
        return;
    }
    ApiKeyRotationPolicy policy{};
    g_api_key_rotation_manager->getPolicy(policy);
    if (!policy.enabled) {
        return;
    }
    g_api_key_rotation_manager->scheduleRotation(entry.id.c_str(), entry.label.c_str());
}

void SecurityManager::cancelRotationForKey(const psram_string& key_id) const {
    if (!g_api_key_rotation_manager || key_id.empty()) {
        return;
    }
    g_api_key_rotation_manager->cancelRotation(key_id.c_str());
}

void SecurityManager::setAlertPolicy(const SecurityAlertPolicy& policy) {
    SecurityAlertPolicy new_policy;

    new_policy.email.enabled = policy.email.enabled;
    new_policy.email.throttle_minutes = policy.email.throttle_minutes;
    new_policy.email.subject = policy.email.subject.empty()
        ? PSRAMUtils::createPSRAMString("Security Alert")
        : PSRAMUtils::createPSRAMString(policy.email.subject.c_str());

    {
        PSRAMAllocator<psram_string> alloc;
        new_policy.email.recipients = psram_string_vector(alloc);
        for (const auto& recipient : policy.email.recipients) {
            if (!recipient.empty()) {
                new_policy.email.recipients.push_back(
                    PSRAMUtils::createPSRAMString(recipient.c_str()));
            }
        }
    }

    new_policy.webhook.enabled = policy.webhook.enabled;
    new_policy.webhook.url = PSRAMUtils::createPSRAMString(policy.webhook.url.c_str());
    new_policy.webhook.token = PSRAMUtils::createPSRAMString(policy.webhook.token.c_str());
    new_policy.gpio = policy.gpio;

    {
        std::lock_guard<std::mutex> lock(alert_policy_mutex_);
        alert_policy_ = new_policy;
        cfg_.alert_policy = new_policy;
    }
}

void SecurityManager::getAlertPolicy(SecurityAlertPolicy& out_policy) const {
    std::lock_guard<std::mutex> lock(alert_policy_mutex_);

    out_policy.email.enabled = alert_policy_.email.enabled;
    out_policy.email.throttle_minutes = alert_policy_.email.throttle_minutes;
    out_policy.email.subject = PSRAMUtils::createPSRAMString(alert_policy_.email.subject.c_str());

    {
        PSRAMAllocator<psram_string> alloc;
        out_policy.email.recipients = psram_string_vector(alloc);
        for (const auto& recipient : alert_policy_.email.recipients) {
            out_policy.email.recipients.push_back(
                PSRAMUtils::createPSRAMString(recipient.c_str()));
        }
    }

    out_policy.webhook.enabled = alert_policy_.webhook.enabled;
    out_policy.webhook.url = PSRAMUtils::createPSRAMString(alert_policy_.webhook.url.c_str());
    out_policy.webhook.token = PSRAMUtils::createPSRAMString(alert_policy_.webhook.token.c_str());
    out_policy.gpio = alert_policy_.gpio;
}

void SecurityManager::getSecurityConfigSnapshot(SecurityConfig& out_cfg) const {
    std::lock_guard<std::mutex> lock(alert_policy_mutex_);
    out_cfg = cfg_;
}

psram_string SecurityManager::hashAdminPassword(const psram_string& password) const {
    if (password.empty()) {
        return PSRAMUtils::createPSRAMString("");
    }

    // Generate random salt
    psram_string salt_b64 = generateRandomSalt(PBKDF2_SALT_SIZE);
    if (salt_b64.empty()) {
        LOG_ERROR(TAG_SEC, "Failed to generate salt for PBKDF2");
        return PSRAMUtils::createPSRAMString("");
    }

    // Decode salt from base64
    size_t salt_len = 0;
    mbedtls_base64_decode(nullptr, 0, &salt_len,
                         (const unsigned char*)salt_b64.c_str(), salt_b64.size());

    uint8_t* salt = (uint8_t*)heap_caps_malloc(salt_len, MALLOC_CAP_SPIRAM);
    if (!salt) {
        LOG_ERROR(TAG_SEC, "Failed to allocate PSRAM for decoded salt");
        return PSRAMUtils::createPSRAMString("");
    }

    size_t actual_len = 0;
    int ret = mbedtls_base64_decode(salt, salt_len, &actual_len,
                                    (const unsigned char*)salt_b64.c_str(), salt_b64.size());
    if (ret != 0) {
        heap_caps_free(salt);
        LOG_ERRORF(TAG_SEC, "Failed to decode salt: %d", ret);
        return PSRAMUtils::createPSRAMString("");
    }

    // Compute PBKDF2
    psram_string hash_b64 = computePBKDF2(password, salt, actual_len, DEFAULT_PBKDF2_ITERATIONS);
    heap_caps_free(salt);

    if (hash_b64.empty()) {
        LOG_ERROR(TAG_SEC, "Failed to compute PBKDF2");
        return PSRAMUtils::createPSRAMString("");
    }

    // Format: "pbkdf2:salt_b64:iterations:hash_b64"
    char iter_buf[16];
    snprintf(iter_buf, sizeof(iter_buf), "%u", (unsigned int)DEFAULT_PBKDF2_ITERATIONS);

    psram_string result = PSRAMUtils::createPSRAMString("pbkdf2:");
    result.append(salt_b64);
    result.append(":");
    result.append(iter_buf);
    result.append(":");
    result.append(hash_b64);

    LOG_INFO(TAG_SEC, "Generated PBKDF2 password hash with 100000 iterations");
    return result;
}

bool SecurityManager::loadAdminPasswordHash(psram_string& hash_out) {
    hash_out.clear();

    nvs_handle_t handle;
    esp_err_t err = nvs_open("security", NVS_READONLY, &handle);
    if (err != ESP_OK) {
        return false;
    }

    size_t length = 0;
    err = nvs_get_str(handle, "admin_pwd", nullptr, &length);
    if (err != ESP_OK || length == 0) {
        nvs_close(handle);
        return false;
    }

    char* buffer = (char*)heap_caps_malloc(length, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (!buffer) {
        nvs_close(handle);
        LOG_WARNING(TAG_SEC, "Failed to allocate PSRAM while loading admin password hash");
        return false;
    }

    err = nvs_get_str(handle, "admin_pwd", buffer, &length);
    if (err == ESP_OK) {
        hash_out = PSRAMUtils::createPSRAMString(buffer);
    }

