il-prof-f-a/ESP32-OT-Security-Assessment/src/security/security_manager.cpp
    heap_caps_free(buffer);
    nvs_close(handle);
    return err == ESP_OK;
}

bool SecurityManager::storeAdminPasswordHash(const psram_string& hash) {
    if (hash.empty()) {
        return false;
    }

    nvs_handle_t handle;
    esp_err_t err = nvs_open("security", NVS_READWRITE, &handle);
    if (err != ESP_OK) {
        LOG_WARNINGF(TAG_SEC, "Failed to open NVS for admin password hash: %s", esp_err_to_name(err));
        return false;
    }

    err = nvs_set_str(handle, "admin_pwd", hash.c_str());
    if (err == ESP_OK) {
        err = nvs_commit(handle);
    }
    nvs_close(handle);

    if (err != ESP_OK) {
        LOG_WARNINGF(TAG_SEC, "Failed to persist admin password hash: %s", esp_err_to_name(err));
        return false;
    }
    return true;
}
void SecurityManager::getApiKeyMetrics(ApiKeyMetrics& out_metrics) const {
    out_metrics = {};
    {
        std::lock_guard<std::mutex> lock(api_keys_mutex_);
        out_metrics.total = static_cast<uint32_t>(api_keys_.size());
        for (const auto& entry : api_keys_) {
            if (entry.enabled) {
                ++out_metrics.enabled;
            }
            if (entry.rotation_alert_sent) {
                ++out_metrics.rotation_required;
            }
            if (entry.disable_alert_sent) {
                ++out_metrics.disabled_pending_rotation;
            }
            if (out_metrics.newest_created_ms == 0 || entry.created_ms > out_metrics.newest_created_ms) {
                out_metrics.newest_created_ms = entry.created_ms;
            }
            if (out_metrics.oldest_created_ms == 0 || entry.created_ms < out_metrics.oldest_created_ms) {
                out_metrics.oldest_created_ms = entry.created_ms;
            }
        }
    }
}

void SecurityManager::getSecurityEvents(psram_vector<SecurityEventLog>& out_events) const {
    std::lock_guard<std::mutex> lock(security_events_mutex_);
    PSRAMAllocator<SecurityEventLog> alloc;
    psram_vector<SecurityEventLog> copy(alloc);
    copy = security_events_;
    out_events.swap(copy);
}

bool SecurityManager::acknowledgeSecurityEvent(const psram_string& event_id,
                                               const psram_string& actor,
                                               bool acknowledged) {
    if (event_id.empty()) {
        return false;
    }

    std::lock_guard<std::mutex> lock(security_events_mutex_);
    for (auto& ev : security_events_) {
        if (ev.id == event_id) {
            ev.acknowledged = acknowledged;
            if (acknowledged) {
                ev.ack_timestamp_ms = esp_timer_get_time() / 1000ULL;
                ev.acked_by = actor.empty()
                    ? PSRAMUtils::createPSRAMString("web-ui")
                    : actor;
            } else {
                ev.ack_timestamp_ms = 0;
                ev.acked_by = PSRAMUtils::createPSRAMString("");
            }
            return true;
        }
    }
    return false;
}

void SecurityManager::recordSecurityEvent(const char* type,
                                          const char* severity,
                                          const psram_string& summary,
                                          const psram_string& detail_json) {
    const char* resolved_type = (type && *type) ? type : "security_alert";
    const char* resolved_severity = (severity && *severity) ? severity : "info";

    SecurityEventLog entry;
    entry.type = PSRAMUtils::createPSRAMString(resolved_type);
    entry.severity = PSRAMUtils::createPSRAMString(resolved_severity);
    entry.summary = PSRAMUtils::createPSRAMString(summary.c_str());
    entry.detail_json = PSRAMUtils::createPSRAMString(detail_json.c_str());
    entry.timestamp_ms = esp_timer_get_time() / 1000ULL;
    entry.ack_timestamp_ms = 0;
    entry.acknowledged = false;
    entry.acked_by = PSRAMUtils::createPSRAMString("");

    psram_string event_id = generateSecureToken();
    if (event_id.empty()) {
        char fallback[40];
        snprintf(fallback, sizeof(fallback), "evt_%llu",
                 static_cast<unsigned long long>(entry.timestamp_ms));
        event_id = PSRAMUtils::createPSRAMString(fallback);
    }
    entry.id = event_id;

    {
        std::lock_guard<std::mutex> lock(security_events_mutex_);
        security_events_.push_back(entry);
        if (security_events_.size() > kMaxSecurityEvents) {
            security_events_.erase(security_events_.begin());
        }
    }

    if (!g_reporting) {
        return;
    }

    cJSON* root = cJSON_CreateObject();
    if (!root) {
        return;
    }

    cJSON_AddStringToObject(root, "id", entry.id.c_str());
    cJSON_AddStringToObject(root, "type", entry.type.c_str());
    cJSON_AddStringToObject(root, "severity", entry.severity.c_str());
    cJSON_AddStringToObject(root, "summary", entry.summary.c_str());
    if (!entry.detail_json.empty()) {
        cJSON_AddStringToObject(root, "detail", entry.detail_json.c_str());
    }
    cJSON_AddNumberToObject(root, "timestamp_ms", static_cast<double>(entry.timestamp_ms));
    cJSON_AddBoolToObject(root, "acknowledged", entry.acknowledged);
    if (entry.ack_timestamp_ms) {
        cJSON_AddNumberToObject(root, "ack_timestamp_ms", static_cast<double>(entry.ack_timestamp_ms));
    }
    if (!entry.acked_by.empty()) {
        cJSON_AddStringToObject(root, "acked_by", entry.acked_by.c_str());
    }

    cJSON* policy_obj = cJSON_CreateObject();
    SecurityAlertPolicy policy_snapshot;
    getAlertPolicy(policy_snapshot);

    if (policy_obj) {

        cJSON* email_obj = cJSON_CreateObject();
        if (email_obj) {
            cJSON_AddBoolToObject(email_obj, "enabled", policy_snapshot.email.enabled);
            cJSON_AddNumberToObject(email_obj, "throttle_minutes",
                                    static_cast<double>(policy_snapshot.email.throttle_minutes));
            if (!policy_snapshot.email.subject.empty()) {
                cJSON_AddStringToObject(email_obj, "subject", policy_snapshot.email.subject.c_str());
            }
            if (!policy_snapshot.email.recipients.empty()) {
                cJSON* recipients = cJSON_CreateArray();
                if (recipients) {
                    for (const auto& addr : policy_snapshot.email.recipients) {
                        cJSON_AddItemToArray(recipients, cJSON_CreateString(addr.c_str()));
                    }
                    cJSON_AddItemToObject(email_obj, "recipients", recipients);
                }
            }
            cJSON_AddItemToObject(policy_obj, "email", email_obj);
        }

        cJSON* webhook_obj = cJSON_CreateObject();
        if (webhook_obj) {
            cJSON_AddBoolToObject(webhook_obj, "enabled", policy_snapshot.webhook.enabled);
            if (!policy_snapshot.webhook.url.empty()) {
                cJSON_AddStringToObject(webhook_obj, "url", policy_snapshot.webhook.url.c_str());
            }
            cJSON_AddItemToObject(policy_obj, "webhook", webhook_obj);
        }

        cJSON* gpio_obj = cJSON_CreateObject();
        if (gpio_obj) {
            cJSON_AddBoolToObject(gpio_obj, "enabled", policy_snapshot.gpio.enabled);
            cJSON_AddNumberToObject(gpio_obj, "critical_pin", policy_snapshot.gpio.critical_pin);
            cJSON_AddNumberToObject(gpio_obj, "warning_pin", policy_snapshot.gpio.warning_pin);
            cJSON_AddNumberToObject(gpio_obj, "buzzer_pin", policy_snapshot.gpio.buzzer_pin);
            cJSON_AddItemToObject(policy_obj, "gpio", gpio_obj);
        }

        cJSON_AddItemToObject(root, "alert_policy", policy_obj);
    }

    char* json = cJSON_PrintUnformatted(root);
    psram_string payload;
    if (json) {
        payload = PSRAMUtils::createPSRAMString(json);
        free(json);
    }
    cJSON_Delete(root);

