il-prof-f-a/ESP32-OT-Security-Assessment/src/security/security_manager.cpp
    if (payload.empty()) {
        return;
    }

    if (g_reporting) {
        psram_string security_channel = PSRAMUtils::createPSRAMString("security");
        g_reporting->reportEventToChannel(security_channel, entry.type, payload);
    }

    dispatchSecurityEvent(entry.type, payload, entry.severity.c_str(), entry.timestamp_ms, policy_snapshot);
}


void SecurityManager::dispatchSecurityEvent(const psram_string& type,
                                            const psram_string& payload,
                                            const char* severity,
                                            uint64_t timestamp_ms,
                                            const SecurityAlertPolicy& policy) {
    (void)severity;
    if (!g_reporting) {
        return;
    }

    uint64_t now_ms = timestamp_ms;

    if (policy.email.enabled) {
        bool allow = true;
        if (policy.email.throttle_minutes > 0) {
            uint64_t interval_ms = static_cast<uint64_t>(policy.email.throttle_minutes) * 60ULL * 1000ULL;
            if (last_email_alert_ms_ != 0 && (now_ms - last_email_alert_ms_) < interval_ms) {
                allow = false;
            }
        }
        if (allow) {
            g_reporting->reportEventToChannel(PSRAMUtils::createPSRAMString("email"), type, payload);
            last_email_alert_ms_ = now_ms;
        }
    }

    if (policy.webhook.enabled) {
        g_reporting->reportEventToChannel(PSRAMUtils::createPSRAMString("webhook"), type, payload);
        last_webhook_alert_ms_ = now_ms;
    }

    if (policy.gpio.enabled) {
        g_reporting->reportEventToChannel(PSRAMUtils::createPSRAMString("gpio"), type, payload);
    }
}
